DataProcessors/ИсправлениеРегистраТоварыОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ИсправлениеРегистраТоварыОрганизаций</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/ТоварыОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыОрганизаций</Name>
			<Comment>(Общ)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Комиссионер</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/КатегорииОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КатегорииОбъектов</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Категория</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/КорректировкаЗаписейРегистров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>КорректировкаЗаписейРегистров</Name>
			<Comment>(Общ)</Comment>
			<Posting>Deny</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПредметыЭлектронныхПисем</xr:Item>
				<xr:Item>AccumulationRegister.ПланыПродаж</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыОтветственногоХраненияПереданные</xr:Item>
				<xr:Item>AccumulationRegister.РазмещениеЗаказовПокупателей</xr:Item>
				<xr:Item>AccumulationRegister.НоменклатураГотоваяЕхатьККлиенту</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыПоставщикам</xr:Item>
				<xr:Item>AccumulationRegister.НДСНачисленный</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыОтветственногоХранения</xr:Item>
				<xr:Item>AccumulationRegister.ПланыЗакупок</xr:Item>
				<xr:Item>InformationRegister.ЛимитыВозвратнойТары</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВРознице</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСборкеНоНеСобранные</xr:Item>
				<xr:Item>AccumulationRegister.СобраноПоЗаказу</xr:Item>
				<xr:Item>AccumulationRegister.ВнутренниеЗаказы</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыПокупателей</xr:Item>
				<xr:Item>InformationRegister.СписанныеТовары</xr:Item>
				<xr:Item>AccumulationRegister.НДСсАвансов</xr:Item>
				<xr:Item>InformationRegister.ИсточникИнформацииПриОбращении</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВЯчейках</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыПолученные</xr:Item>
				<xr:Item>InformationRegister.СкидкиНоменклатурыНатуральные</xr:Item>
				<xr:Item>AccumulationRegister.НДСВключенныйВСтоимость</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыКПередачеОрганизаций</xr:Item>
				<xr:Item>InformationRegister.УсловияПоставокПоДоговорамКонтрагентовОбщие</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредстваКПолучению</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыКПеремещениюВНТТ</xr:Item>
				<xr:Item>AccumulationRegister.НДСПредъявленныйРеализация0</xr:Item>
				<xr:Item>AccumulationRegister.ПланируемыеПоступленияДенежныхСредств</xr:Item>
				<xr:Item>InformationRegister.СкидкиНаценкиНоменклатуры</xr:Item>
				<xr:Item>InformationRegister.ПричиныЗакрытияЗаказов</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСПодотчетнымиЛицами</xr:Item>
				<xr:Item>AccumulationRegister.НДСПредъявленный</xr:Item>
				<xr:Item>AccumulationRegister.Закупки</xr:Item>
				<xr:Item>InformationRegister.СкидкиНаценкиПоЦеновымГруппам</xr:Item>
				<xr:Item>InformationRegister.ПорогиНакопительныхСкидок</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыГотовыеКСборке</xr:Item>
				<xr:Item>InformationRegister.ЦеныНоменклатуры</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваровПереданные</xr:Item>
				<xr:Item>AccumulationRegister.НДСКосвенныеРасходы</xr:Item>
				<xr:Item>AccumulationRegister.ДопРасходыНаПриобретениеТоваров</xr:Item>
				<xr:Item>AccumulationRegister.ПродажиПоДисконтнымКартам</xr:Item>
				<xr:Item>InformationRegister.ЦеныНоменклатурыКонтрагентов</xr:Item>
				<xr:Item>AccumulationRegister.ДвиженияДенежныхСредств</xr:Item>
				<xr:Item>InformationRegister.ВремяДействияСкидок</xr:Item>
				<xr:Item>InformationRegister.ДиапазоныЦенДляНаценки</xr:Item>
				<xr:Item>AccumulationRegister.НДСРасчетыСПокупателями</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыОрганизацийМТ</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыПереданные</xr:Item>
				<xr:Item>InformationRegister.КалендарныеПотребностиВНоменклатуре</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
				<xr:Item>AccumulationRegister.ЗаявкиНаРасходованиеСредств</xr:Item>
				<xr:Item>AccumulationRegister.НДСЗаписиКнигиПокупок</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыТОХпоДаннымПоставщиков</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСКонтрагентами</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентами</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредстваКомитента</xr:Item>
				<xr:Item>AccumulationRegister.НДСУчетРаспределенныхОплатПокупателей</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВРезервеТОХ</xr:Item>
				<xr:Item>AccumulationRegister.НДСУчетРаспределенныхОплатПоставщикам</xr:Item>
				<xr:Item>AccumulationRegister.НДСПартииТоваров</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов</xr:Item>
				<xr:Item>AccumulationRegister.РозничнаяВыручка</xr:Item>
				<xr:Item>InformationRegister.ABCКлассификацияПокупателей</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредстваКСписанию</xr:Item>
				<xr:Item>AccumulationRegister.НДСРасчетыСПоставщиками</xr:Item>
				<xr:Item>AccumulationRegister.НДСРеализация0</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыОрганизаций</xr:Item>
				<xr:Item>AccumulationRegister.ПродажиСебестоимость</xr:Item>
				<xr:Item>InformationRegister.ЗначенияТочкиЗаказа</xr:Item>
				<xr:Item>AccumulationRegister.РеализованныеТовары</xr:Item>
				<xr:Item>InformationRegister.УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре</xr:Item>
				<xr:Item>AccumulationRegister.ПредоставленныеСкидки</xr:Item>
				<xr:Item>InformationRegister.ТипыЦенПоГруппамНоменклатурыДляПокупателей</xr:Item>
				<xr:Item>InformationRegister.СтадииВзаимоотношенийСПокупателями</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВРезервеНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>InformationRegister.ЦеныАТТ</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВНТТ</xr:Item>
				<xr:Item>AccumulationRegister.РазмещениеЗаявокНаРасходованиеСредств</xr:Item>
				<xr:Item>AccumulationRegister.ЗаданиеНаДоставку</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВСборке</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредстваВРезерве</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредстваКомиссионера</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыКПолучениюНаСклады</xr:Item>
				<xr:Item>AccumulationRegister.Затраты</xr:Item>
				<xr:Item>AccumulationRegister.НДСЗаписиКнигиПродаж</xr:Item>
				<xr:Item>InformationRegister.НаценкиПоУсловиямПродаж</xr:Item>
				<xr:Item>InformationRegister.СпецПредложения</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыКПередачеСоСкладов</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваровНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьЗаполнениеДвижений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаРегистровНакопления</Name>
					<Comment>(Общ)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТаблицаРегистровСведений</Name>
					<Comment>(Общ)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗаполнениеДвижений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Действие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВнешниеОбработки</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/ИсправлениеРегистраТоварыОрганизаций/Ext/ObjectModule.bsl
Процедура ИсправитьТоварыОрганизаций() Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Месяц));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(НачалоМесяца(Месяц)));
	Запрос.Текст = "ВЫБРАТЬ
	               |	КорректировкаЗаписейРегистровТаблицаРегистровНакопления.Ссылка
	               |ИЗ
	               |	Документ.КорректировкаЗаписейРегистров.ТаблицаРегистровНакопления КАК КорректировкаЗаписейРегистровТаблицаРегистровНакопления
	               |ГДЕ
	               |	КорректировкаЗаписейРегистровТаблицаРегистровНакопления.Имя ПОДОБНО ""ТоварыОрганизаций""
	               |	И КорректировкаЗаписейРегистровТаблицаРегистровНакопления.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И КорректировкаЗаписейРегистровТаблицаРегистровНакопления.Ссылка.Комментарий ПОДОБНО ""Исправление регистра Товары орагнизаций, создан автоматически""
	               |	И НЕ КорректировкаЗаписейРегистровТаблицаРегистровНакопления.Ссылка.ПометкаУдаления";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		 ДокКорректировка = Выборка.Ссылка.ПолучитьОбъект();
		 НЗ = РегистрыНакопления.ТоварыОрганизаций.СоздатьНаборЗаписей();
		 НЗ.Отбор.Регистратор.Установить(Выборка.Ссылка);
		 НЗ.Записать();
	Иначе
		 ДокКорректировка = Документы.КорректировкаЗаписейРегистров.СоздатьДокумент();		 
	КонецЕсли;
	
	СоздатьДОкументКорректировки(ДокКорректировка);
	
КонецПроцедуры

Процедура СоздатьДОкументКорректировки(ДокКорректировка)
    
	ДокКорректировка.Дата =  НачалоМесяца(Месяц);
	Движения = ДокКорректировка.Движения; 
	 
	НС = ДокКорректировка.ТаблицаРегистровНакопления.Добавить(); 
	НС.Имя = "ТоварыОрганизаций";
	НС.Представление = "Товары организаций";
	Движения_ТО = Движения.ТоварыОрганизаций;
	ДокКорректировка.Комментарий = "Исправление регистра Товары орагнизаций, создан автоматически";
	ДокКорректировка.Записать(); 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ДокКорректировка.Дата);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТоварыОрганизацийОстатки.Организация,
	               |	ТоварыОрганизацийОстатки.Комиссионер,
	               |	ТоварыОрганизацийОстатки.Номенклатура,
	               |	ТоварыОрганизацийОстатки.ХарактеристикаНоменклатуры,
	               |	ТоварыОрганизацийОстатки.СерияНоменклатуры,
	               |	ТоварыОрганизацийОстатки.Качество,
	               |	ТоварыОрганизацийОстатки.Склад,
	               |	ТоварыОрганизацийОстатки.КоличествоОстаток
	               |ПОМЕСТИТЬ ВТ_Организация1
	               |ИЗ
	               |	РегистрНакопления.ТоварыОрганизаций.Остатки(
	               |			&Дата,
	               |			Организация В
	               |				(ВЫБРАТЬ
	               |					КатегорииОбъектов.Объект
	               |				ИЗ
	               |					РегистрСведений.КатегорииОбъектов КАК КатегорииОбъектов
	               |				ГДЕ
	               |					КатегорииОбъектов.Категория = ЗНАЧЕНИЕ(Справочник.КатегорииОбъектов.УправленческийУчет))) КАК ТоварыОрганизацийОстатки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТоварыОрганизацийОстатки.Организация,
	               |	ТоварыОрганизацийОстатки.Комиссионер,
	               |	ТоварыОрганизацийОстатки.Номенклатура,
	               |	ТоварыОрганизацийОстатки.ХарактеристикаНоменклатуры,
	               |	ТоварыОрганизацийОстатки.СерияНоменклатуры,
	               |	ТоварыОрганизацийОстатки.Качество,
	               |	ТоварыОрганизацийОстатки.Склад,
	               |	ТоварыОрганизацийОстатки.КоличествоОстаток
	               |ПОМЕСТИТЬ ВТ_Организация2
	               |ИЗ
	               |	РегистрНакопления.ТоварыОрганизаций.Остатки(
	               |			&Дата,
	               |			Организация В
	               |				(ВЫБРАТЬ
	               |					КатегорииОбъектов.Объект
	               |				ИЗ
	               |					РегистрСведений.КатегорииОбъектов КАК КатегорииОбъектов
	               |				ГДЕ
	               |					КатегорииОбъектов.Категория = ЗНАЧЕНИЕ(Справочник.КатегорииОбъектов.РегламентированныйУчет))) КАК ТоварыОрганизацийОстатки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Организация1.Номенклатура,
	               |	ВТ_Организация1.ХарактеристикаНоменклатуры,
	               |	ВТ_Организация1.СерияНоменклатуры,
	               |	ВТ_Организация1.Качество,
	               |	ВТ_Организация1.Склад,
	               |	ВТ_Организация1.КоличествоОстаток КАК ОстатокОрганизация1,
	               |	ВТ_Организация2.КоличествоОстаток КАК ОстатокОрганизация2
	               |ПОМЕСТИТЬ ВТ_СвернутыеСтроки
	               |ИЗ
	               |	ВТ_Организация1 КАК ВТ_Организация1
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Организация2 КАК ВТ_Организация2
	               |		ПО ВТ_Организация1.Номенклатура = ВТ_Организация2.Номенклатура
	               |			И ВТ_Организация1.ХарактеристикаНоменклатуры = ВТ_Организация2.ХарактеристикаНоменклатуры
	               |			И ВТ_Организация1.СерияНоменклатуры = ВТ_Организация2.СерияНоменклатуры
	               |			И ВТ_Организация1.Качество = ВТ_Организация2.Качество
	               |			И ВТ_Организация1.Склад = ВТ_Организация2.Склад
	               |ГДЕ
	               |	ВТ_Организация1.КоличествоОстаток + ВТ_Организация2.КоличествоОстаток = 0
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Организация1.Организация КАК Организация,
	               |	ВТ_Организация1.Комиссионер,
	               |	ВТ_Организация1.Номенклатура КАК Номенклатура,
	               |	ВТ_Организация1.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	               |	ВТ_Организация1.СерияНоменклатуры КАК СерияНоменклатуры,
	               |	ВТ_Организация1.Качество,
	               |	ВТ_Организация1.Склад,
	               |	ВТ_Организация1.КоличествоОстаток
	               |ИЗ
	               |	ВТ_Организация1 КАК ВТ_Организация1
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СвернутыеСтроки КАК ВТ_СвернутыеСтроки
	               |		ПО ВТ_Организация1.Номенклатура = ВТ_СвернутыеСтроки.Номенклатура
	               |			И ВТ_Организация1.ХарактеристикаНоменклатуры = ВТ_СвернутыеСтроки.ХарактеристикаНоменклатуры
	               |			И ВТ_Организация1.СерияНоменклатуры = ВТ_СвернутыеСтроки.СерияНоменклатуры
	               |			И ВТ_Организация1.Качество = ВТ_СвернутыеСтроки.Качество
	               |			И ВТ_Организация1.Склад = ВТ_СвернутыеСтроки.Склад
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВТ_Организация2.Организация,
	               |	ВТ_Организация2.Комиссионер,
	               |	ВТ_Организация2.Номенклатура,
	               |	ВТ_Организация2.ХарактеристикаНоменклатуры,
	               |	ВТ_Организация2.СерияНоменклатуры,
	               |	ВТ_Организация2.Качество,
	               |	ВТ_Организация2.Склад,
	               |	ВТ_Организация2.КоличествоОстаток
	               |ИЗ
	               |	ВТ_Организация2 КАК ВТ_Организация2
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СвернутыеСтроки КАК ВТ_СвернутыеСтроки
	               |		ПО ВТ_Организация2.Номенклатура = ВТ_СвернутыеСтроки.Номенклатура
	               |			И ВТ_Организация2.ХарактеристикаНоменклатуры = ВТ_СвернутыеСтроки.ХарактеристикаНоменклатуры
	               |			И ВТ_Организация2.СерияНоменклатуры = ВТ_СвернутыеСтроки.СерияНоменклатуры
	               |			И ВТ_Организация2.Качество = ВТ_СвернутыеСтроки.Качество
	               |			И ВТ_Организация2.Склад = ВТ_СвернутыеСтроки.Склад
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Номенклатура,
	               |	ХарактеристикаНоменклатуры,
	               |	СерияНоменклатуры,
	               |	Организация";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
	    Движение = Движения_ТО.Добавить();
	    Движение.Период 			= ДокКорректировка.Дата;
	    Движение.Регистратор 		= ДокКорректировка.Ссылка;
	    Движение.ВидДвижения 		= ?(Выборка.КоличествоОстаток > 0, ВидДвиженияНакопления.Расход, ВидДвиженияНакопления.Приход);
		Движение.Количество 		= ?(Выборка.КоличествоОстаток > 0, Выборка.КоличествоОстаток, -Выборка.КоличествоОстаток);
	    Движение.Активность			= Истина;
	    Движение.Организация		= Выборка.Организация;
	    Движение.Комиссионер  		= Выборка.Комиссионер;
	    Движение.Номенклатура		= Выборка.Номенклатура; 
		Движение.ХарактеристикаНоменклатуры	= Выборка.ХарактеристикаНоменклатуры;
		Движение.СерияНоменклатуры	= Выборка.СерияНоменклатуры;
		Движение.Качество			= Выборка.Качество;
		Движение.Склад				= Выборка.Склад;
		//Движение.Количество 		= Выборка.КоличествоОстаток;
	КонецЦикла;
	
	Движения_ТО.Записать();
	ДокКорректировка.Записать();
	
КонецПроцедуры
